app/Controllers/AchatControllers.php

    public function afficherFormulaire($caisseId)
    {
        $caisseModel = new CaisseModel();
        $clientModel = new ClientModel();
        $produitModel = new ProduitModel();

        return view('achat/achat', [
            'caisse' => $caisseModel->find($caisseId),
            'clients' => $clientModel->findAll(),
            'produits' => $produitModel->findAll()
        ]);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'

public function insert_achat()
{
    $achatMereModel = new Achat_mere();
    $achatFilleModel = new Achat_fille();
    $caisseModel = new CaisseModel();
    $produitModel = new ProduitModel();

    $db = \Config\Database::connect();

    $caisseId = $this->request->getPost('caisse_id');
    $idClient = $this->request->getPost('idClient');

    $details = json_decode(
        $this->request->getPost('detailsAchat'),
        true
    );

    if (!$caisseModel->find($caisseId)) {
        return redirect()->back()
            ->with('error', 'Caisse introuvable');
    }

    if (empty($details)) {
        return redirect()->back()
            ->with('error', 'Aucun produit sélectionné');
    }

    foreach ($details as $detail) {

        $produit = $produitModel->find($detail['id_produit']);

        if (!$produit) {
            return redirect()->back()
                ->with('error', 'Produit introuvable');
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'
SELECT *
FROM `produit`
WHERE `produit`.`id` = '1'
SELECT *
FROM `produit`


    foreach ($details as $detail) {

        $achatFilleModel->insert([
            'id_achat_mere' => $achatMereId,
            'id_produit' => $detail['id_produit'],
            'quantite' => $detail['quantite']
        ]);

        $produit = $produitModel->find($detail['id_produit']);
---
INSERT INTO `achat_fille` (`id_achat_mere`, `id_produit`, `quantite`) VALUES (7, '1', 100)
SELECT *
FROM `produit`
WHERE `produit`.`id` = '1'

            $produit['quantite_en_stock']
            - $detail['quantite'];

        $produitModel->update(
            $detail['id_produit'],
            [
                'quantite_en_stock' => $nouveauStock
            ]
        );
---
UPDATE `produit` SET `quantite_en_stock` = 0
WHERE `produit`.`id` IN ('1')