app/Controllers/AchatControllers.php

INSERT INTO `achat_fille` (`id_achat_mere`, `id_produit`, `quantite`) VALUES (5, '1', '1')
---
    public function insert_achat()
    {
        $caisseModel = new CaisseModel();
        $achatMereModel = new Achat_mere();
        $achatFilleModel = new Achat_fille();

        $caisse_id = $this->request->getPost('caisse_id');
        $idClient = $this->request->getPost('idClient');
        $idproduits = $this->request->getPost('produit_id');
        $qtt = $this->request->getPost('quantite');

        if (!$caisseModel->find($caisse_id)) {
            return redirect()->back()->with('error', 'Caisse non trouvée.');
        }

        $achatMereData = [
            'id_caisse' => $caisse_id,
            'idClient' => $idClient
        ];
        $achatMereId = $achatMereModel->insertAchaMere($achatMereData);

        $achatFilleData = [
            'id_achat_mere' => $achatMereId,
            'id_produit' => $idproduit,
            'quantite' => $qtt
        ];
        $achatFilleModel->insert($achatFilleData);