app/Controllers/AchatControllers.php

INSERT INTO `achat_fille` (`id_achat_mere`, `id_produit`, `quantite`) VALUES (6, '1', 2)
---

        foreach ($details as $detail) {

            $achatFilleModel->insert([
                'id_achat_mere' => $achatMereId,
                'id_produit' => $detail['id_produit'],
                'quantite' => $detail['quantite']
            ]);