app/Controllers/CaisseController.php

    public function checkCaisse()
    {
        $caisseId = $this->request->getGet('caisse_id');

        $caisse = $this->caisseModel->find($caisseId);
        $produits = $this->produitModel->findAll();
        $clients = $this->clientModel->findAll();
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'
SELECT *
FROM `produit`
SELECT *
FROM `client`