app/Models/Achat_mere.php

    public function insertAchaMere($data)
    {
        $this->insert($data);
---
INSERT INTO `achat_mere` (`id_caisse`, `id_client`) VALUES ('2', '3')