app/Models/Achat_fille.php

SELECT *
FROM `achat_fille`
WHERE `id_achat_mere` = 5
---
    public function getAllAchatFilleByIdAchatMere($idAchatMere)
    {
        return $this->where('id_achat_mere', $idAchatMere)->findAll();