app/Models/v_achat_fille_produitModel.php

SELECT *
FROM `v_achat_fille_produit`
WHERE `id_achat_mere` = 2
---
    public function get_v_achatfille_produit_by_idAchatMere($id)
    {
        return $this->where('id_achat_mere', $id)->findAll();